# ServerId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCalculationServerInfo..::..ServerId Property
MEPCalculationServerInfo Class See Also
---
The Id of the server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Guid ServerId { get; set; }
```

Visual Basic
---
```text
Public Property ServerId As Guid
	Get
	Set
```

Visual C++
---
```text
public:
property Guid ServerId {
	Guid get ();
	void set (Guid value);
}
```

# See Also
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace